import { Component } from '@angular/core';

@Component({
  selector: 'app-home',
  templateUrl: './home.component.html',
  styleUrls: ['./home.component.css']
})
export class HomeComponent {
  isExpanded: boolean[] = [false, false, false, false, false, false];

  scholars = [
    {
      image: 'assets/bana.jpeg',
      altText: 'Khadim Hussain Rizvi',
      title: 'خادم حسین رضوی',
      shortText: 'خادم حسین رضوی ایک پاکستانی اسلامی اسکالر اور سیاستدان تھے، جنہوں نے تحریک لبیک پاکستان (TLP) کی بنیاد رکھی۔',
      moreText: 'ان کا مشن پاکستان میں اسلام اور ناموسِ رسالت ﷺ کا دفاع کرنا تھا۔ ان کا اندازِ خطابت ان کی شناخت بنا، جس میں وہ اپنی کرشماتی آواز اور جوشیلے انداز میں اسلام اور ناموسِ رسالت ﷺ کی حمایت کرتے تھے۔'
    },
    {
      image: 'assets/kh.jpeg',
      altText: 'Saad Hussain Rizvi',
      title: 'سعد حسین رضوی',
      shortText: 'سعد حسین رضوی، خادم حسین رضوی کے بیٹے، تحریک لبیک پاکستان (TLP) کے حالیہ امیر ہیں۔',
      moreText: 'انہوں نے اپنے والد کی وفات کے بعد TLP کی قیادت سنبھالی اور ان کے مشن کو آگے بڑھایا۔ سعد رضوی نے اپنے والد کے مشن کو جاری رکھا اور پاکستان میں ناموسِ رسالت ﷺ کی حمایت کے لیے اپنی آواز بلند کی۔'
    },
    {
      image: 'assets/babajan.jpeg',
      altText: 'Khadim Hussain Rizvi\'s Urs',
      title: 'خادم حسین رضوی کا عرس',
      shortText: 'خادم حسین رضوی کا عرس ہر سال ان کی یاد میں منایا جاتا ہے، جس میں ہزاروں لوگ ان کے مشن کو یاد کرتے ہیں اور ان کے لیے دعا کرتے ہیں۔',
      moreText: 'یہ دن TLP کے پیروکاروں کے لیے ایک خاص اہمیت رکھتا ہے جہاں وہ اپنے لیڈر کی یاد کو تازہ کرتے ہیں اور ان کی خدمات اور جذبات کو سراہا جاتا ہے۔'
    },
    {
      image: 'assets/ameeni.jpeg',
      altText: 'Shafeeq Ameeni',
      title: 'شفق امینی',
      shortText: 'شفق امینی صاحب ایک محترم اسلامی اسکالر اور مبلغ ہیں، جو تحریک لبیک پاکستان (TLP) کے اہم رکن ہیں۔',
      moreText: 'انہوں نے اپنے علم اور تعلیم کے ذریعے TLP کی آئیڈیالوجی اور مشن کو عام کرنے میں اہم کردار ادا کیا ہے۔ ان کا اندازِ خطابت عقیدہ اور جذبے سے بھرپور ہے، جو لوگوں کو اپنے مقاصد سے آگاہ کرنے اور انہیں ایک جذبے سے بھرپور کرنے میں مددگار ثابت ہوتا ہے۔'
    },
    {
      image: 'assets/fakhri.jpeg',
      altText: 'Mufti Qasim Fakhri',
      title: 'مفتی قاسم فخری',
      shortText: 'مفتی قاسم فخری ایک محترم اسلامی اسکالر اور مبلغ ہیں، جو اپنے علم اور تحقیق سے لوگوں میں دین کی تعلیم کو عام کرنے میں مصروف ہیں۔',
      moreText: 'ان کا مشن اسلام کے اصل پیغام کو عام کرنا، اور مسلمانوں کو اپنے دین کے اصل مقاصد سے آگاہ کرنا ہے۔ ان کی خدمات کو ان کے علاقے میں عزت کی نگاہ سے دیکھا جاتا ہے۔'
    },
    {
      image: 'assets/laabaik.jpeg',
      altText: 'Tehreek-e-Labbaik Pakistan',
      title: 'تحریک لبیک پاکستان',
      shortText: 'تحریک لبیک پاکستان (TLP) ایک پاکستانی سیاسی اور مذہبی پارٹی ہے، جو 2015 میں خادم حسین رضوی صاحب کے ذریعے قائم ہوئی۔',
      moreText: 'اس کا اصل مقصد اسلام کی حمایت اور ناموسِ رسالت ﷺ کی طرف لوگوں کو آگاہ کرنا ہے۔ TLP کی ایک اہم تحریک 2017 کا فیض آباد دھرنا تھا، جو ناموسِ رسالت ﷺ اور اسلام کے مقاصد کے لیے تھا۔'
    }
  ];

  toggleExpand(index: number): void {
    this.isExpanded[index] = !this.isExpanded[index];
  }
}
